[
    {
        "tag": "Website",
        "name": "Software Portfolio",
        "skills": "JavaScript. React. GitHub",
        "summary": "My Personal Software portfolio to display all my projects and career advancements all in one place",
        "main_image": "/tabs/portfoliotab/main.png",
        "figma": "https://www.figma.com/design/dlBQr60QiRyJgpzlwP027k/Portfolio-Design?node-id=2546-734&t=7npDHg8z592pGDps-0",
        "github": "https://github.com/boblz/Portfolio",
        "website": "https://boblz.github.io/Portfolio/",
        "user_goals_summary":"My audience are the recruiters and interviewers of software companies.<p>By giving them proof of my work without using too many words, as well as an easy UI to navigate, I can impress my audience in a quick and interactive way.</p>" ,
        "user_goals_subtitle": "Show, don't tell.",
        "user_goals_image": "/tabs/portfoliotab/career.png",
        "design_goals_summary":"Design-wise, I planned out the layout designs and buttons to motivate the audience to explore my portfolio.<p>On the technical side, I utilized HTML and CSS for the frontend, and JavaScript to utilize state hooks. I also made the website dynamic using NoSQL so that any project additions can be made quickly and easily.</p>",
        "design_goals_subtitle":"Combining both Frontend and Backend skills.",
        "design_goals_image":"/tabs/portfoliotab/figma.png",
        "prototyping_summary":"I am always improving the website whether it is through better design, animations, or discovering new APIs.<p>I do this by reading on the latest tech trends, or getting feedback from friends.</p>",
        "prototyping_subtitle":"Improving through continuous redevelopment.",
        "prototyping_image":"/tabs/portfoliotab/react.png"
    },
    {
        "tag": "AI",
        "name": "Support Ticket Endpoint",
        "skills": "API. Flask. Postman. ChatGPT",
        "summary": "An endpoint that uses AI and data analysis techniques to filter out uncessary words on support tickets",
        "main_image": "/tabs/supporttickettab/support_ticket.png",
        "figma": null,
        "github": "https://github.com/ama4bob/Personal-Backend-SupportTicketFilter",
        "website": null,
        "user_goals_summary":"The data analysis script is used to remove support tickets that do not conform to certain ticketing rules. Using data algorithms and ChatGPT, the script can remove both tickets that are considered “junk” and reduce the words in the ticket to easily identify the issue." ,
        "user_goals_subtitle": "Improving the efficiency of support tickets.",
        "user_goals_image": "/tabs/supporttickettab/website.png",
        "design_goals_summary":"To design the script, I opted to find the technology stack most appropriate for this problem. I chose Python, Flask, and Postman to write and test the API endpoint. I used the Rabin-Karp algorithm to handle the pattern matching, and ChatGPT AI to handle texts that were too subjective to handle. ",
        "design_goals_subtitle":"Using AI and algorithms to solve real world problems.",
        "design_goals_image":"/tabs/supporttickettab/chatgpt.png",
        "prototyping_summary":"The end result was a basic data analysis script that uses state-of-the-art technology. The script is able to reduce ticket content by roughly 25% or more, making tickets easier to read and catalogue.<p>I plan to improve each prototype by making better diagnostic tools, and trying to improve the time it takes to parse each ticket. I also aim to provide product improvements by creating UI to catalogue tickets for filing that I believe will help support ticket specialists improve their efficiency.</p>",
        "prototyping_subtitle":"Making scripts easier to diagonse and use for everyday people.",
        "prototyping_image":"/tabs/supporttickettab/postman.png"        
    }
    
]